In [25]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('student_dataset.csv')

In [3]:
df

,StudentID,Name,Age,Gender,Math,Science,English,Attendance,City,Grade
0,1,Student_1,21.0,NaN,35.0,39.0,90.0,71.0,Delhi,D
1,2,Student_2,NaN,Male,35.0,70.0,62.0,98.0,Mumbai,A
2,3,Student_3,20.0,Female,87.0,57.0,80.0,100.0,NaN,C
3,4,Student_4,NaN,Male,NaN,79.0,95.0,67.0,NaN,C
4,5,Student_5,NaN,NaN,52.0,86.0,49.0,85.0,Hyderabad,C
...,...,...,...,...,...,...,...,...,...,...
95,96,Student_96,20.0,Male,82.0,55.0,42.0,63.0,Mumbai,D
96,97,Student_97,NaN,Male,50.0,100.0,91.0,83.0,Mumbai,C
97,98,Student_98,19.0,Male,77.0,59.0,50.0,60.0,Hyderabad,A
98,99,Student_99,19.0,Male,63.0,49.0,40.0,68.0,Mumbai,C
99,100,Student_100,18.0,NaN,79.0,84.0,79.0,88.0,Chennai,C

In [4]:
student = pd.DataFrame(df)

In [5]:
student['Math'] = student['Math'].fillna(student['Math'].mean())

In [6]:
student

,StudentID,Name,Age,Gender,Math,Science,English,Attendance,City,Grade
0,1,Student_1,21.0,NaN,35.000000,39.0,90.0,71.0,Delhi,D
1,2,Student_2,NaN,Male,35.000000,70.0,62.0,98.0,Mumbai,A
2,3,Student_3,20.0,Female,87.000000,57.0,80.0,100.0,NaN,C
3,4,Student_4,NaN,Male,65.824742,79.0,95.0,67.0,NaN,C
4,5,Student_5,NaN,NaN,52.000000,86.0,49.0,85.0,Hyderabad,C
...,...,...,...,...,...,...,...,...,...,...
95,96,Student_96,20.0,Male,82.000000,55.0,42.0,63.0,Mumbai,D
96,97,Student_97,NaN,Male,50.000000,100.0,91.0,83.0,Mumbai,C
97,98,Student_98,19.0,Male,77.000000,59.0,50.0,60.0,Hyderabad,A
98,99,Student_99,19.0,Male,63.000000,49.0,40.0,68.0,Mumbai,C
99,100,Student_100,18.0,NaN,79.000000,84.0,79.0,88.0,Chennai,C

In [7]:
student['Math'] = student['Math'].round(2)

In [8]:
student

,StudentID,Name,Age,Gender,Math,Science,English,Attendance,City,Grade
0,1,Student_1,21.0,NaN,35.00,39.0,90.0,71.0,Delhi,D
1,2,Student_2,NaN,Male,35.00,70.0,62.0,98.0,Mumbai,A
2,3,Student_3,20.0,Female,87.00,57.0,80.0,100.0,NaN,C
3,4,Student_4,NaN,Male,65.82,79.0,95.0,67.0,NaN,C
4,5,Student_5,NaN,NaN,52.00,86.0,49.0,85.0,Hyderabad,C
...,...,...,...,...,...,...,...,...,...,...
95,96,Student_96,20.0,Male,82.00,55.0,42.0,63.0,Mumbai,D
96,97,Student_97,NaN,Male,50.00,100.0,91.0,83.0,Mumbai,C
97,98,Student_98,19.0,Male,77.00,59.0,50.0,60.0,Hyderabad,A
98,99,Student_99,19.0,Male,63.00,49.0,40.0,68.0,Mumbai,C
99,100,Student_100,18.0,NaN,79.00,84.0,79.0,88.0,Chennai,C

In [11]:
student['City'] = student['City'].ffill()

In [12]:
student

,StudentID,Name,Age,Gender,Math,Science,English,Attendance,City,Grade
0,1,Student_1,21.0,NaN,35.00,39.0,90.0,71.0,Delhi,D
1,2,Student_2,NaN,Male,35.00,70.0,62.0,98.0,Mumbai,A
2,3,Student_3,20.0,Female,87.00,57.0,80.0,100.0,Mumbai,C
3,4,Student_4,NaN,Male,65.82,79.0,95.0,67.0,Mumbai,C
4,5,Student_5,NaN,NaN,52.00,86.0,49.0,85.0,Hyderabad,C
...,...,...,...,...,...,...,...,...,...,...
95,96,Student_96,20.0,Male,82.00,55.0,42.0,63.0,Mumbai,D
96,97,Student_97,NaN,Male,50.00,100.0,91.0,83.0,Mumbai,C
97,98,Student_98,19.0,Male,77.00,59.0,50.0,60.0,Hyderabad,A
98,99,Student_99,19.0,Male,63.00,49.0,40.0,68.0,Mumbai,C
99,100,Student_100,18.0,NaN,79.00,84.0,79.0,88.0,Chennai,C

In [15]:
student['Age'].isnull

<bound method Series.isnull of 0     21.0
1      NaN
2     20.0
3      NaN
4      NaN
      ...
95    20.0
96     NaN
97    19.0
98    19.0
99    18.0
Name: Age, Length: 100, dtype: float64>

In [16]:
student['Age'] = student['Age'].fillna(student['Age'].mean())

In [17]:
student

,StudentID,Name,Age,Gender,Math,Science,English,Attendance,City,Grade
0,1,Student_1,21.000000,NaN,35.00,39.0,90.0,71.0,Delhi,D
1,2,Student_2,19.617284,Male,35.00,70.0,62.0,98.0,Mumbai,A
2,3,Student_3,20.000000,Female,87.00,57.0,80.0,100.0,Mumbai,C
3,4,Student_4,19.617284,Male,65.82,79.0,95.0,67.0,Mumbai,C
4,5,Student_5,19.617284,NaN,52.00,86.0,49.0,85.0,Hyderabad,C
...,...,...,...,...,...,...,...,...,...,...
95,96,Student_96,20.000000,Male,82.00,55.0,42.0,63.0,Mumbai,D
96,97,Student_97,19.617284,Male,50.00,100.0,91.0,83.0,Mumbai,C
97,98,Student_98,19.000000,Male,77.00,59.0,50.0,60.0,Hyderabad,A
98,99,Student_99,19.000000,Male,63.00,49.0,40.0,68.0,Mumbai,C
99,100,Student_100,18.000000,NaN,79.00,84.0,79.0,88.0,Chennai,C

In [20]:
student['Age'] = student['Age'].round(2)

In [21]:
student

,StudentID,Name,Age,Gender,Math,Science,English,Attendance,City,Grade
0,1,Student_1,21.00,NaN,21.00,39.0,90.0,71.0,Delhi,D
1,2,Student_2,19.62,Male,19.62,70.0,62.0,98.0,Mumbai,A
2,3,Student_3,20.00,Female,20.00,57.0,80.0,100.0,Mumbai,C
3,4,Student_4,19.62,Male,19.62,79.0,95.0,67.0,Mumbai,C
4,5,Student_5,19.62,NaN,19.62,86.0,49.0,85.0,Hyderabad,C
...,...,...,...,...,...,...,...,...,...,...
95,96,Student_96,20.00,Male,20.00,55.0,42.0,63.0,Mumbai,D
96,97,Student_97,19.62,Male,19.62,100.0,91.0,83.0,Mumbai,C
97,98,Student_98,19.00,Male,19.00,59.0,50.0,60.0,Hyderabad,A
98,99,Student_99,19.00,Male,19.00,49.0,40.0,68.0,Mumbai,C
99,100,Student_100,18.00,NaN,18.00,84.0,79.0,88.0,Chennai,C

In [23]:
student['Total'] = student[['Math','Science','English']].sum(axis = 1)
student

,StudentID,Name,Age,Gender,Math,Science,English,Attendance,City,Grade,Total
0,1,Student_1,21.00,NaN,21.00,39.0,90.0,71.0,Delhi,D,150.00
1,2,Student_2,19.62,Male,19.62,70.0,62.0,98.0,Mumbai,A,151.62
2,3,Student_3,20.00,Female,20.00,57.0,80.0,100.0,Mumbai,C,157.00
3,4,Student_4,19.62,Male,19.62,79.0,95.0,67.0,Mumbai,C,193.62
4,5,Student_5,19.62,NaN,19.62,86.0,49.0,85.0,Hyderabad,C,154.62
...,...,...,...,...,...,...,...,...,...,...,...
95,96,Student_96,20.00,Male,20.00,55.0,42.0,63.0,Mumbai,D,117.00
96,97,Student_97,19.62,Male,19.62,100.0,91.0,83.0,Mumbai,C,210.62
97,98,Student_98,19.00,Male,19.00,59.0,50.0,60.0,Hyderabad,A,128.00
98,99,Student_99,19.00,Male,19.00,49.0,40.0,68.0,Mumbai,C,108.00
99,100,Student_100,18.00,NaN,18.00,84.0,79.0,88.0,Chennai,C,181.00

In [24]:
student['Gender'] = student['Gender'].bfill()
student

,StudentID,Name,Age,Gender,Math,Science,English,Attendance,City,Grade,Total
0,1,Student_1,21.00,Male,21.00,39.0,90.0,71.0,Delhi,D,150.00
1,2,Student_2,19.62,Male,19.62,70.0,62.0,98.0,Mumbai,A,151.62
2,3,Student_3,20.00,Female,20.00,57.0,80.0,100.0,Mumbai,C,157.00
3,4,Student_4,19.62,Male,19.62,79.0,95.0,67.0,Mumbai,C,193.62
4,5,Student_5,19.62,Female,19.62,86.0,49.0,85.0,Hyderabad,C,154.62
...,...,...,...,...,...,...,...,...,...,...,...
95,96,Student_96,20.00,Male,20.00,55.0,42.0,63.0,Mumbai,D,117.00
96,97,Student_97,19.62,Male,19.62,100.0,91.0,83.0,Mumbai,C,210.62
97,98,Student_98,19.00,Male,19.00,59.0,50.0,60.0,Hyderabad,A,128.00
98,99,Student_99,19.00,Male,19.00,49.0,40.0,68.0,Mumbai,C,108.00
99,100,Student_100,18.00,NaN,18.00,84.0,79.0,88.0,Chennai,C,181.00

In [26]:
conditions = [
    student['Total'] < 120,
    student['Total'] <= 180,
    student['Total'] <= 240
]
choices = ['needs to improve','better','good']

student['Performance'] = np.select(conditions,choices)
student

,StudentID,Name,Age,Gender,Math,Science,English,Attendance,City,Grade,Total,Performance
0,1,Student_1,21.00,Male,21.00,39.0,90.0,71.0,Delhi,D,150.00,better
1,2,Student_2,19.62,Male,19.62,70.0,62.0,98.0,Mumbai,A,151.62,better
2,3,Student_3,20.00,Female,20.00,57.0,80.0,100.0,Mumbai,C,157.00,better
3,4,Student_4,19.62,Male,19.62,79.0,95.0,67.0,Mumbai,C,193.62,good
4,5,Student_5,19.62,Female,19.62,86.0,49.0,85.0,Hyderabad,C,154.62,better
...,...,...,...,...,...,...,...,...,...,...,...,...
95,96,Student_96,20.00,Male,20.00,55.0,42.0,63.0,Mumbai,D,117.00,needs to improve
96,97,Student_97,19.62,Male,19.62,100.0,91.0,83.0,Mumbai,C,210.62,good
97,98,Student_98,19.00,Male,19.00,59.0,50.0,60.0,Hyderabad,A,128.00,better
98,99,Student_99,19.00,Male,19.00,49.0,40.0,68.0,Mumbai,C,108.00,needs to improve
99,100,Student_100,18.00,NaN,18.00,84.0,79.0,88.0,Chennai,C,181.00,good

In [41]:
filter = df[(df['English'] > 60) & ((df['City'] == 'Delhi') | (df['Attendance'] >= 80))]
filter.count().sum()

307

In [42]:
filter = df[(df['English'] > 60) & (df['City'] == 'Delhi') | (df['Attendance'] >= 80)]
filter.count().sum()

501

In [43]:
student.to_csv('new_student_dataset.csv',index = False)

In [4]:
df1 = pd.read_csv('new_student_dataset.csv')
df1

,StudentID,Name,Age,Gender,Math,Science,English,Attendance,City,Grade,Total,Performance
0,1,Student_1,21.00,Male,21.00,39.0,90.0,71.0,Delhi,D,150.00,better
1,2,Student_2,19.62,Male,19.62,70.0,62.0,98.0,Mumbai,A,151.62,better
2,3,Student_3,20.00,Female,20.00,57.0,80.0,100.0,Mumbai,C,157.00,better
3,4,Student_4,19.62,Male,19.62,79.0,95.0,67.0,Mumbai,C,193.62,good
4,5,Student_5,19.62,Female,19.62,86.0,49.0,85.0,Hyderabad,C,154.62,better
...,...,...,...,...,...,...,...,...,...,...,...,...
95,96,Student_96,20.00,Male,20.00,55.0,42.0,63.0,Mumbai,D,117.00,needs to improve
96,97,Student_97,19.62,Male,19.62,100.0,91.0,83.0,Mumbai,C,210.62,good
97,98,Student_98,19.00,Male,19.00,59.0,50.0,60.0,Hyderabad,A,128.00,better
98,99,Student_99,19.00,Male,19.00,49.0,40.0,68.0,Mumbai,C,108.00,needs to improve
99,100,Student_100,18.00,NaN,18.00,84.0,79.0,88.0,Chennai,C,181.00,good

In [5]:
df1['Grade'] = df1['Grade'].bfill()
df1['Gender'] = df1['Gender'].fillna("Female")
df1['Science'] = df1['Science'].fillna(df1['Science'].mean())
df1['Attendance'] = df1['Attendance'].fillna(df1['Attendance'].mean())
df1['English'] = df1['English'].fillna(df1['English'].mean())
df1

,StudentID,Name,Age,Gender,Math,Science,English,Attendance,City,Grade,Total,Performance
0,1,Student_1,21.00,Male,21.00,39.0,90.0,71.0,Delhi,D,150.00,better
1,2,Student_2,19.62,Male,19.62,70.0,62.0,98.0,Mumbai,A,151.62,better
2,3,Student_3,20.00,Female,20.00,57.0,80.0,100.0,Mumbai,C,157.00,better
3,4,Student_4,19.62,Male,19.62,79.0,95.0,67.0,Mumbai,C,193.62,good
4,5,Student_5,19.62,Female,19.62,86.0,49.0,85.0,Hyderabad,C,154.62,better
...,...,...,...,...,...,...,...,...,...,...,...,...
95,96,Student_96,20.00,Male,20.00,55.0,42.0,63.0,Mumbai,D,117.00,needs to improve
96,97,Student_97,19.62,Male,19.62,100.0,91.0,83.0,Mumbai,C,210.62,good
97,98,Student_98,19.00,Male,19.00,59.0,50.0,60.0,Hyderabad,A,128.00,better
98,99,Student_99,19.00,Male,19.00,49.0,40.0,68.0,Mumbai,C,108.00,needs to improve
99,100,Student_100,18.00,Female,18.00,84.0,79.0,88.0,Chennai,C,181.00,good

In [15]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import OneHotEncoder

# df = pd.read_csv("new_student_dataset.csv")
                 
one = OneHotEncoder(sparse_output = False,drop="first")
encoder = one.fit_transform(df1[['Gender']])
encoder_df = pd.DataFrame(
    encoder,
    columns=one.get_feature_names_out(['Gender'])
)

df = df1.drop(columns=['Gender']).join(encoder_df)
df

,StudentID,Name,Age,Math,Science,English,Attendance,City,Grade,Total,Performance,Gender_Male
0,1,Student_1,21.00,21.00,39.0,90.0,71.0,Delhi,D,150.00,better,1.0
1,2,Student_2,19.62,19.62,70.0,62.0,98.0,Mumbai,A,151.62,better,1.0
2,3,Student_3,20.00,20.00,57.0,80.0,100.0,Mumbai,C,157.00,better,0.0
3,4,Student_4,19.62,19.62,79.0,95.0,67.0,Mumbai,C,193.62,good,1.0
4,5,Student_5,19.62,19.62,86.0,49.0,85.0,Hyderabad,C,154.62,better,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...
95,96,Student_96,20.00,20.00,55.0,42.0,63.0,Mumbai,D,117.00,needs to improve,1.0
96,97,Student_97,19.62,19.62,100.0,91.0,83.0,Mumbai,C,210.62,good,1.0
97,98,Student_98,19.00,19.00,59.0,50.0,60.0,Hyderabad,A,128.00,better,1.0
98,99,Student_99,19.00,19.00,49.0,40.0,68.0,Mumbai,C,108.00,needs to improve,1.0
99,100,Student_100,18.00,18.00,84.0,79.0,88.0,Chennai,C,181.00,good,0.0

In [6]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import OneHotEncoder

# df = pd.read_csv("new_student_dataset.csv")
                 
one = OneHotEncoder(drop="first",sparse_output = False)
encoder = one.fit_transform(df1[['Performance','Gender','City']])
encoder_df = pd.DataFrame(
    encoder,
    columns=one.get_feature_names_out(['Performance','Gender','City'])
)

df = df1.drop(columns=['Performance','Gender','City']).join(encoder_df)
df.tail(20)

,StudentID,Name,Age,Math,Science,English,Attendance,Grade,Total,Performance_good,Performance_needs to improve,Gender_Male,City_Delhi,City_Hyderabad,City_Mumbai
80,81,Student_81,19.62,19.62,88.00000,58.0,95.0,C,165.62,0.0,0.0,1.0,0.0,1.0,0.0
81,82,Student_82,18.00,18.00,95.00000,85.0,99.0,B,198.00,1.0,0.0,0.0,0.0,0.0,0.0
82,83,Student_83,19.62,19.62,56.00000,86.0,94.0,A,161.62,0.0,0.0,0.0,1.0,0.0,0.0
83,84,Student_84,19.62,19.62,42.00000,56.0,85.0,D,117.62,0.0,1.0,0.0,0.0,1.0,0.0
84,85,Student_85,18.00,18.00,45.00000,49.0,75.0,D,112.00,0.0,1.0,0.0,1.0,0.0,0.0
85,86,Student_86,18.00,18.00,71.14433,90.0,67.0,B,108.00,0.0,1.0,0.0,0.0,1.0,0.0
86,87,Student_87,18.00,18.00,91.00000,72.0,91.0,B,181.00,1.0,0.0,1.0,0.0,0.0,0.0
87,88,Student_88,18.00,18.00,71.14433,86.0,78.0,C,104.00,0.0,1.0,1.0,0.0,0.0,0.0
88,89,Student_89,21.00,21.00,67.00000,75.0,71.0,C,163.00,0.0,0.0,0.0,0.0,0.0,0.0
89,90,Student_90,20.00,20.00,81.00000,91.0,86.0,A,192.00,1.0,0.0,1.0,1.0,0.0,0.0
90,91,Student_91,20.00,20.00,71.14433,72.0,87.0,A,92.00,0.0,1.0,0.0,1.0,0.0,0.0
91,92,Student_92,18.00,18.00,49.00000,47.0,71.0,A,114.00,0.0,1.0,0.0,1.0,0.0,0.0
92,93,Student_93,20.00,20.00,94.00000,38.0,93.0,A,152.00,0.0,0.0,0.0,1.0,0.0,0.0
93,94,Student_94,20.00,20.00,97.00000,68.0,64.0,D,185.00,1.0,0.0,0.0,0.0,0.0,1.0
94,95,Student_95,18.00,18.00,96.00000,51.0,76.0,D,165.00,0.0,0.0,1.0,0.0,0.0,1.0
95,96,Student_96,20.00,20.00,55.00000,42.0,63.0,D,117.00,0.0,1.0,1.0,0.0,0.0,1.0
96,97,Student_97,19.62,19.62,100.00000,91.0,83.0,C,210.62,1.0,0.0,1.0,0.0,0.0,1.0
97,98,Student_98,19.00,19.00,59.00000,50.0,60.0,A,128.00,0.0,0.0,1.0,0.0,1.0,0.0
98,99,Student_99,19.00,19.00,49.00000,40.0,68.0,C,108.00,0.0,1.0,1.0,0.0,0.0,1.0
99,100,Student_100,18.00,18.00,84.00000,79.0,88.0,C,181.00,1.0,0.0,0.0,0.0,0.0,0.0

In [3]:
# import matplotlib.pyplot as plt
# import pandas as pd

# plt.scatter(df1['Total'],df1['Attendance'],color = 'blue',marker='^')
# plt.title('Total VS Attendance')
# plt.xlabel('Total')
# plt.ylabel('Attendance')
# plt.show()

In [18]:
from sklearn.preprocessing import StandardScaler
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression

x = df1[["Attendance","Math","Science","English"]]
y = df1["Total"]

x_train,x_test,y_train,y_test = train_test_split(
    x,y,test_size = 0.2,random_state = 42)

scale = StandardScaler()
x_train = scale.fit_transform(x_train)
x_test = scale.transform(x_test)

model = LinearRegression()
model.fit(x_train,y_train)

y_pred = model.predict(x_test)
print(y_pred)

[117.36684932 169.70103996 135.16154271 124.99359717 123.26018286
 141.18670351 108.83361544 166.72127816 140.25010253 147.23747068
 150.88120734 126.49011521 148.34599419 130.69693581 162.27268972
 155.06028518 122.67533246 198.69396325 149.88370172 201.01844815]

In [25]:
# from sklearn.metrics import accuracy_score, classification_report

# print(accuracy_score(y_test, y_pred))
# print(classification_report(y_test, y_pred))
from sklearn.metrics import mean_absolute_error,mean_squared_error

mea = mean_absolute_error(y_test,y_pred)
sq = mean_squared_error(y_test,y_pred)
rmse = mean_squared_error(y_test, y_pred, squared=False)


print(rmse)
print(model.score(x_test,y_test))
print(mea)
print(sq)

16.50138302379938
0.6393239703779514
7.2336260278358395
272.2956416981344

C:\Users\PMSS MIDHIL\anaconda3\Lib\site-packages\sklearn\metrics\_regression.py:492: FutureWarning: 'squared' is deprecated in version 1.4 and will be removed in 1.6. To calculate the root mean squared error, use the function'root_mean_squared_error'.
  warnings.warn(

In [26]:
from sklearn.model_selection import cross_val_score

scores = cross_val_score(model, x, y, cv=5,
                        scoring = "neg_mean_absolute_error")
print(-scores)
print(-scores.mean())

[ 5.86291442  4.72628342  4.20367733  4.52515478 11.51658848]
6.166923685799477